#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.lambda_package: Reading...
data.archive_file.lambda_package: Read complete after 0s [id=310dbc35124836edb8d0ee4e0d6233e8e4e1ab97]
aws_iam_role.access_s3: Refreshing state... [id=access_s3_role]
aws_api_gateway_rest_api.transcription_gateway: Refreshing state... [id=hzjgd3yz9g]
aws_iam_role.lambda_role: Refreshing state... [id=lambda-role]
aws_iam_group.s3_access_group: Refreshing state... [id=s3-access-group]
aws_s3_bucket.transcript-bucket: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_iam_user.s3_user: Refreshing state... [id=s3-access-user]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY]
aws_iam_policy.secrets_manager_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/secrets_manager_policy]
aws_security_group.allow_all: Refreshing state... [id=sg-066a59bd2a442570c]
aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::117572128031:policy/lambda_policy]
aws_iam_group_policy_attachment.s3_access_attachment: Refreshing state... [id=s3-access-group-20240104131439668300000001]
aws_iam_user_group_membership.s3_user_membership: Refreshing state... [id=terraform-20240104131439668600000002]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=lambda-role-20231209192723088800000001]
aws_iam_role_policy_attachment.lambda_basic["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=lambda-role-20231209192723097600000002]
aws_iam_role_policy_attachment.secrets_manager_access: Refreshing state... [id=access_s3_role-20240108171038164300000001]
aws_iam_role_policy_attachment.s3_access: Refreshing state... [id=access_s3_role-20231221190250570200000001]
aws_iam_instance_profile.ec2_profile: Refreshing state... [id=ec2_s3_profile]
aws_secretsmanager_secret_version.api_key_version: Refreshing state... [id=arn:aws:secretsmanager:eu-central-1:117572128031:secret:transcription_service_api_key-lOlyvY|1E089146-5E44-4923-9EAF-FFC1D2AAAB88]
aws_api_gateway_resource.root: Refreshing state... [id=w3noxm]
aws_instance.transcription_server: Refreshing state... [id=i-057929d3c0866364f]
aws_api_gateway_method.options: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_method_response.options_response: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_api_gateway_integration.options_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-OPTIONS]
aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_integration_response.options_integration_response: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-OPTIONS-200]
aws_s3_bucket_policy.transcript-bucket-policy: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_s3_bucket_cors_configuration.transcript-bucket-cors: Refreshing state... [id=transcript-bucket20231207181110470300000001]
aws_lambda_function.start_lambda: Refreshing state... [id=startTranscriptionFunction]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-hzjgd3yz9g-w3noxm-GET]
aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-hzjgd3yz9g-w3noxm-GET-200]
aws_api_gateway_deployment.deployment: Refreshing state... [id=2jg5nq]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_integration.options_integration must be replaced
-/+ resource "aws_api_gateway_integration" "options_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "w3noxm" -> (known after apply)
      ~ id                      = "agi-hzjgd3yz9g-w3noxm-OPTIONS" -> (known after apply)
      + integration_http_method = "OPTIONS" # forces replacement
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
        # (7 unchanged attributes hidden)
    }

  # aws_instance.transcription_server will be updated in-place
  ~ resource "aws_instance" "transcription_server" {
        id                                   = "i-057929d3c0866364f"
      ~ instance_type                        = "g5.xlarge" -> "g4dn.xlarge"
        tags                                 = {
            "Name" = "Transcription Server"
        }
        # (33 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ns144, Action: `pull_request`*